=============|||
Basic CASE
=============|||

---- MODULE Test ----
op ==
    CASE 1 -> 2
    [] 3 -> 4
    [] OTHER -> 5
====

--------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (case
      (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
      (case_box) (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
      (case_box) (other_arm (case_arrow) (number (nat_number)))
    )
  ))
(double_line)))

=============|||
Conjlist with CASE
=============|||

---- MODULE Test ----
op ==
  /\  CASE 1 -> 2
      [] 3 -> 2
      [] OTHER -> 5
  /\ 6
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (case
          (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (other_arm (case_arrow) (number (nat_number)))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
(double_line)))

=============|||
Conjlist inside CASE
=============|||

---- MODULE Test ----
op ==
  CASE
    /\ 1
    /\ 2
      ->
        /\ 3
        /\ 4
  []
    /\ 5
    /\ 6
      ->
        /\ 7
        /\ 8
  [] OTHER ->
    /\ 7
    /\ 8
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (case
      (case_arm
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
        (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
      (case_box)
      (case_arm
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
        (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
      (case_box)
      (other_arm (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
    )
  ))
(double_line)))

=============|||
Disjlist with CASE
=============|||

---- MODULE Test ----
op ==
  \/  CASE 1 -> 2
      [] 3 -> 2
      [] OTHER -> 5
  \/ 6
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (case
          (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (other_arm (case_arrow) (number (nat_number)))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
(double_line)))

=============|||
Disjlist inside CASE
=============|||

---- MODULE Test ----
op ==
  CASE
    \/ 1
    \/ 2
      ->
        \/ 3
        \/ 4
  []
    \/ 5
    \/ 6
      ->
        \/ 7
        \/ 8
  [] OTHER ->
    \/ 7
    \/ 8
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (case
      (case_arm
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
        (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
      (case_box)
      (case_arm
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
        (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
      (case_box)
      (other_arm (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
    )
  ))
(double_line)))
