====================|||
Solitary Comment
====================|||

---- MODULE Test ----
\* This is a comment
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (comment)
(double_line)))

====================|||
Comment In Definition
====================|||

---- MODULE Test ----
op == \* This is a comment
    id
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq) (comment)
    (identifier)
  ))
(double_line)))

====================|||
Solitary Block Comment
====================|||

---- MODULE Test ----
(*
This
is
a
multi
line
comment
*)
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (block_comment)
(double_line)))

====================|||
Block Comment in Expression
====================|||

---- MODULE Test ----
op == 1 +
(*
This
is
a
multi
line
comment
*)
2
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq) (bound_infix_op
      (number (nat_number)) (plus)
      (block_comment)
      (number (nat_number))
    )
  ))
(double_line)))

====================|||
Nested Block Comment
====================|||

---- MODULE Test ----
(*
This
is
a
(*nested*)
multi
line
comment
*)
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (block_comment
    (block_comment)
  )
(double_line)))

====================|||
Complicated Block Comment
====================|||

---- MODULE Test ----
(*
This
( * )
  is a
    (*(*complicated*) *and* (*nested*)*)
  (*multi
  line*)
comment
)
**()**
*)
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (block_comment
    (block_comment
      (block_comment)
      (block_comment)
    )
    (block_comment)
  )
(double_line)))

====================|||
Lookahead Block Comment
====================|||

---- MODULE Test ----
(************************************)
(* This comment requires lookahead
   ((* So does this one **)
   (((((* and this one *****)       *)
(************************************)
====

--------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (block_comment)
  (block_comment
    (block_comment)
    (block_comment)
  )
  (block_comment)
(double_line)))
