=============|||
Basic Conjlist
=============|||

---- MODULE Test ----
op ==
    /\ 1
    /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Inline Conjlist
=============|||

---- MODULE Test ----
op == /\ 1
      /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Start-of-Line Conjlist
=============|||

---- MODULE Test ----
op ==
/\ 1
/\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Left-Shifted Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ 1
/\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (conj_list (conj_item (bullet_conj) (number (nat_number))))
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Right-Shifted Conjlist
=============|||

---- MODULE Test ----
op ==
/\ 1
 /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (bound_infix_op
          (number (nat_number))
          (land)
          (number (nat_number))
        )
      )
    )
  ))
))

=============|||
Separated Conjlist
=============|||

---- MODULE Test ----
op ==
  /\ 1

  /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Multiline Conjlist
=============|||

---- MODULE Test ----
op ==
  /\ 
   1
  /\
   2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Nested Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ /\ 1
    /\ 2
 /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (conj_list
          (conj_item (bullet_conj) (number (nat_number)))
          (conj_item (bullet_conj) (number (nat_number)))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Start-of-Line Nested Conjlist
=============|||

---- MODULE Test ----
op ==
/\ /\ 1
   /\ 2
/\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj)
        (conj_list
          (conj_item (bullet_conj) (number (nat_number)))
          (conj_item (bullet_conj) (number (nat_number)))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Infix Op Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ 1
  + 2 
 /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (bound_infix_op
          (number (nat_number))
          (plus)
          (number (nat_number))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Division Infix Op Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ 1
  / 2 
 /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (bound_infix_op
          (number (nat_number))
          (slash)
          (number (nat_number))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Infix Op Terminated Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ 1
 + 2 
 /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (bound_infix_op
        (conj_list (conj_item (bullet_conj) (number (nat_number))))
        (plus)
        (number (nat_number))
      )
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Division Infix Op Terminated Conjlist
=============|||

---- MODULE Test ----
op ==
 /\ 1
 / 2 
 /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (bound_infix_op
        (conj_list (conj_item (bullet_conj) (number (nat_number))))
        (slash)
        (number (nat_number))
      )
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Not a Conjlist
=============|||

---- MODULE Test ----
op == 1 /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (number (nat_number))
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Conjlist with Parentheses
=============|||

---- MODULE Test ----
op ==
  /\ (1)
  /\ (2)
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (parentheses (number (nat_number))))
      (conj_item (bullet_conj) (parentheses (number (nat_number))))
    )
  ))
))

=============|||
Conjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op == (
  /\ 1
   )
  /\ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (parentheses
        (conj_list (conj_item (bullet_conj) (number (nat_number))))
      )
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Nested Conjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op == (
  /\ 1
  /\  /\ 2
      /\ 3
       )
  /\ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (parentheses
        (conj_list
          (conj_item (bullet_conj) (number (nat_number)))
          (conj_item
            (bullet_conj)
            (conj_list
              (conj_item (bullet_conj) (number (nat_number)))
              (conj_item (bullet_conj) (number (nat_number)))
            )
          )
        )
      )
      (land)
      (number (nat_number))
    )
  ))
))

=============|||
Double-Nested Conjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op ==
  /\ 1
  /\  /\ 2 + (
        /\ 3
        /\ 4
          )
      /\ 5
  /\ 6
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item
        (bullet_conj)
        (conj_list
          (conj_item
            (bullet_conj)
            (bound_infix_op
              (number (nat_number))
              (plus)
              (parentheses
                (conj_list
                  (conj_item (bullet_conj) (number (nat_number)))
                  (conj_item (bullet_conj) (number (nat_number)))
                )
              )
            )
          )
          (conj_item (bullet_conj) (number (nat_number)))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Overly-Permissive Conjlist Parentheses Parsing
=============|||

---- MODULE Test ----
op ==
  /\ 1
  /\ (2 + 3
)
  /\ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item
        (bullet_conj)
        (parentheses
          (bound_infix_op
            (number (nat_number)) (plus) (number (nat_number))
          )
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Module-End-Terminated Conjlist
=============|||

---- MODULE Test ----
op ==
  /\ 1
  /\ 2  ====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Conjlist with Empty Tuple
=============|||

---- MODULE Test ----
op ==
  /\ 1
  /\ <<>>
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (tuple_literal (langle_bracket) (rangle_bracket)))
    )
  ))
))

=============|||
Conjlist with Empty Set
=============|||

---- MODULE Test ----
op ==
  /\ 1
  /\ {}
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item (bullet_conj) (number (nat_number)))
      (conj_item (bullet_conj) (finite_set_literal))
    )
  ))
))

=============|||
Conjlist with ITE
=============|||

---- MODULE Test ----
op ==
  /\  IF 1
      THEN 2
      ELSE 3
  /\ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (if_then_else
          (number (nat_number))
          (number (nat_number))
          (number (nat_number))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Conjlist inside ITE
=============|||

---- MODULE Test ----
op ==
  IF
    /\ 1
    /\ 2
      THEN 3
      ELSE 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (if_then_else
      (conj_list
        (conj_item (bullet_conj) (number (nat_number)))
        (conj_item (bullet_conj) (number (nat_number)))
      )
      (number (nat_number))
      (number (nat_number))
    )
  ))
))

=============|||
Conjlist with CASE
=============|||

---- MODULE Test ----
op ==
  /\  CASE 1 -> 2
      [] 3 -> 2
      [] OTHER -> 5
  /\ 6
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (case
          (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (other_arm (case_arrow) (number (nat_number)))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Conjlist inside CASE
=============|||

---- MODULE Test ----
op ==
  CASE
    /\ 1
    /\ 2
      ->
        /\ 3
        /\ 4
  []
    /\ 5
    /\ 6
      ->
        /\ 7
        /\ 8
  [] OTHER ->
    /\ 7
    /\ 8
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (case
      (case_arm
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
        (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
      (case_box)
      (case_arm
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
        (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
      (case_box)
      (other_arm (case_arrow)
        (conj_list (conj_item (bullet_conj) (number (nat_number))) (conj_item (bullet_conj) (number (nat_number))))
      )
    )
  ))
))

=============|||
Conjlist with LET/IN
=============|||

---- MODULE Test ----
op ==
  /\ LET x == 1 IN 2
  /\ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (let_in
          (operator_definition (identifier) (def_eq) (number (nat_number)))
          (number (nat_number))
        )
      )
      (conj_item (bullet_conj) (number (nat_number)))
    )
  ))
))

=============|||
Conjlist inside LET/IN
=============|||

---- MODULE Test ----
op ==
  LET
    x ==
      /\ 1
      /\ 2
        IN 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (let_in
      (operator_definition (identifier) (def_eq)
        (conj_list
          (conj_item (bullet_conj) (number (nat_number)))
          (conj_item (bullet_conj) (number (nat_number)))
        )
      )
      (number (nat_number))
    )
  ))
))
