=============|||
Basic Disjlist
=============|||

---- MODULE Test ----
op ==
    \/ 1
    \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Inline Disjlist
=============|||

---- MODULE Test ----
op == \/ 1
      \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Start-of-Line Disjlist
=============|||

---- MODULE Test ----
op ==
\/ 1
\/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Left-Shifted Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ 1
\/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (disj_list (disj_item (bullet_disj) (number (nat_number))))
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Right-Shifted Disjlist
=============|||

---- MODULE Test ----
op ==
\/ 1
 \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (bound_infix_op
          (number (nat_number))
          (lor)
          (number (nat_number))
        )
      )
    )
  ))
))

=============|||
Separated Disjlist
=============|||

---- MODULE Test ----
op ==
  \/ 1

  \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Multiline Disjlist
=============|||

---- MODULE Test ----
op ==
  \/ 
   1
  \/
   2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Nested Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ \/ 1
    \/ 2
 \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (disj_list
          (disj_item (bullet_disj) (number (nat_number)))
          (disj_item (bullet_disj) (number (nat_number)))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Start-of-Line Nested Disjlist
=============|||

---- MODULE Test ----
op ==
\/ \/ 1
   \/ 2
\/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj)
        (disj_list
          (disj_item (bullet_disj) (number (nat_number)))
          (disj_item (bullet_disj) (number (nat_number)))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Infix Op Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ 1
  + 2 
 \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (bound_infix_op
          (number (nat_number))
          (plus)
          (number (nat_number))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Division Infix Op Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ 1
  / 2 
 \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (bound_infix_op
          (number (nat_number))
          (slash)
          (number (nat_number))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Infix Op Terminated Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ 1
 + 2 
 \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (bound_infix_op
        (disj_list (disj_item (bullet_disj) (number (nat_number))))
        (plus)
        (number (nat_number))
      )
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Division Infix Op Terminated Disjlist
=============|||

---- MODULE Test ----
op ==
 \/ 1
 / 2 
 \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (bound_infix_op
        (disj_list (disj_item (bullet_disj) (number (nat_number))))
        (slash)
        (number (nat_number))
      )
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Not a Disjlist
=============|||

---- MODULE Test ----
op == 1 \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (number (nat_number))
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Disjlist with Parentheses
=============|||

---- MODULE Test ----
op ==
  \/ (1)
  \/ (2)
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (parentheses (number (nat_number))))
      (disj_item (bullet_disj) (parentheses (number (nat_number))))
    )
  ))
))

=============|||
Disjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op == (
  \/ 1
   )
  \/ 2
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (parentheses
        (disj_list (disj_item (bullet_disj) (number (nat_number))))
      )
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Nested Disjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op == (
  \/ 1
  \/  \/ 2
      \/ 3
       )
  \/ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (bound_infix_op
      (parentheses
        (disj_list
          (disj_item (bullet_disj) (number (nat_number)))
          (disj_item
            (bullet_disj)
            (disj_list
              (disj_item (bullet_disj) (number (nat_number)))
              (disj_item (bullet_disj) (number (nat_number)))
            )
          )
        )
      )
      (lor)
      (number (nat_number))
    )
  ))
))

=============|||
Double-Nested Disjlist Terminated by Parentheses
=============|||

---- MODULE Test ----
op ==
  \/ 1
  \/  \/ 2 + (
        \/ 3
        \/ 4
          )
      \/ 5
  \/ 6
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item
        (bullet_disj)
        (disj_list
          (disj_item
            (bullet_disj)
            (bound_infix_op
              (number (nat_number))
              (plus)
              (parentheses
                (disj_list
                  (disj_item (bullet_disj) (number (nat_number)))
                  (disj_item (bullet_disj) (number (nat_number)))
                )
              )
            )
          )
          (disj_item (bullet_disj) (number (nat_number)))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Overly-Permissive Disjlist Parentheses Parsing
=============|||

---- MODULE Test ----
op ==
  \/ 1
  \/ (2 + 3
)
  \/ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item
        (bullet_disj)
        (parentheses
          (bound_infix_op
            (number (nat_number)) (plus) (number (nat_number))
          )
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Module-End-Terminated Disjlist
=============|||

---- MODULE Test ----
op ==
  \/ 1
  \/ 2  ====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Disjlist with Empty Tuple
=============|||

---- MODULE Test ----
op ==
  \/ 1
  \/ <<>>
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (tuple_literal (langle_bracket) (rangle_bracket)))
    )
  ))
))

=============|||
Disjlist with Empty Set
=============|||

---- MODULE Test ----
op ==
  \/ 1
  \/ {}
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item (bullet_disj) (number (nat_number)))
      (disj_item (bullet_disj) (finite_set_literal))
    )
  ))
))

=============|||
Disjlist with ITE
=============|||

---- MODULE Test ----
op ==
  \/  IF 1
      THEN 2
      ELSE 3
  \/ 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (if_then_else
          (number (nat_number))
          (number (nat_number))
          (number (nat_number))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Disjlist inside ITE
=============|||

---- MODULE Test ----
op ==
  IF
    \/ 1
    \/ 2
      THEN 3
      ELSE 4
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (if_then_else
      (disj_list
        (disj_item (bullet_disj) (number (nat_number)))
        (disj_item (bullet_disj) (number (nat_number)))
      )
      (number (nat_number))
      (number (nat_number))
    )
  ))
))

=============|||
Disjlist with CASE
=============|||

---- MODULE Test ----
op ==
  \/  CASE 1 -> 2
      [] 3 -> 2
      [] OTHER -> 5
  \/ 6
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (case
          (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (case_arm (number (nat_number)) (case_arrow) (number (nat_number)))
          (case_box) (other_arm (case_arrow) (number (nat_number)))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Disjlist inside CASE
=============|||

---- MODULE Test ----
op ==
  CASE
    \/ 1
    \/ 2
      ->
        \/ 3
        \/ 4
  []
    \/ 5
    \/ 6
      ->
        \/ 7
        \/ 8
  [] OTHER ->
    \/ 7
    \/ 8
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (case
      (case_arm
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
        (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
      (case_box)
      (case_arm
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
        (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
      (case_box)
      (other_arm (case_arrow)
        (disj_list (disj_item (bullet_disj) (number (nat_number))) (disj_item (bullet_disj) (number (nat_number))))
      )
    )
  ))
))

=============|||
Disjlist with LET/IN
=============|||

---- MODULE Test ----
op ==
  \/ LET x == 1 IN 2
  \/ 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (let_in
          (operator_definition (identifier) (def_eq) (number (nat_number)))
          (number (nat_number))
        )
      )
      (disj_item (bullet_disj) (number (nat_number)))
    )
  ))
))

=============|||
Disjlist inside LET/IN
=============|||

---- MODULE Test ----
op ==
  LET
    x ==
      \/ 1
      \/ 2
        IN 3
====

-------------|||

(source_file (module (identifier)
  (unit (operator_definition
    (identifier) (def_eq)
    (let_in
      (operator_definition (identifier) (def_eq)
        (disj_list
          (disj_item (bullet_disj) (number (nat_number)))
          (disj_item (bullet_disj) (number (nat_number)))
        )
      )
      (number (nat_number))
    )
  ))
))
