==================|||
ITE with Strings
==================|||

---- MODULE Test ----
op == IF "A" THEN "B" ELSE "C"
====

------------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (if_then_else (string) (string) (string))
  ))
(double_line)))

=============|||
Conjlist with ITE
=============|||

---- MODULE Test ----
op ==
  /\  IF 1
      THEN 2
      ELSE 3
  /\ 4
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (conj_list
      (conj_item
        (bullet_conj)
        (if_then_else
          (number)
          (number)
          (number)
        )
      )
      (conj_item (bullet_conj) (number))
    )
  ))
(double_line)))

=============|||
Conjlist inside ITE
=============|||

---- MODULE Test ----
op ==
  IF
    /\ 1
    /\ 2
      THEN 3
      ELSE 4
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (if_then_else
      (conj_list
        (conj_item (bullet_conj) (number))
        (conj_item (bullet_conj) (number))
      )
      (number)
      (number)
    )
  ))
(double_line)))

=============|||
Disjlist with ITE
=============|||

---- MODULE Test ----
op ==
  \/  IF 1
      THEN 2
      ELSE 3
  \/ 4
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (disj_list
      (disj_item
        (bullet_disj)
        (if_then_else
          (number)
          (number)
          (number)
        )
      )
      (disj_item (bullet_disj) (number))
    )
  ))
(double_line)))

=============|||
Disjlist inside ITE
=============|||

---- MODULE Test ----
op ==
  IF
    \/ 1
    \/ 2
      THEN 3
      ELSE 4
====

-------------|||

(source_file (module (single_line) (identifier) (single_line)
  (unit (operator_definition
    (identifier) (def_eq)
    (if_then_else
      (disj_list
        (disj_item (bullet_disj) (number))
        (disj_item (bullet_disj) (number))
      )
      (number)
      (number)
    )
  ))
(double_line)))
